In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
pd.Series([77,88,99],index=['Ram','Shyam','Hari'])

Ram      77
Shyam    88
Hari     99
dtype: int64

In [5]:
dictionary1={'ram':77,'shyam':81,'hari':99}
pd.Series(dictionary1)

ram      77
shyam    81
hari     99
dtype: int64

In [6]:
pwd

'C:\\Users\\Admin\\Data Science 1PM'

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv('salary_data.csv')

In [9]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [10]:
df.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [11]:
df['Gender']

0         Male
1       Female
2         Male
3       Female
4         Male
         ...
6699    Female
6700      Male
6701    Female
6702      Male
6703    Female
Name: Gender, Length: 6704, dtype: object

In [12]:
df['Gender'] == 'Female'

0       False
1        True
2       False
3        True
4       False
        ...
6699     True
6700    False
6701     True
6702    False
6703     True
Name: Gender, Length: 6704, dtype: bool

In [14]:
num1 = df['Gender']=='Female'
num1.sum()

3014

In [15]:
num2 = df['Gender'] == 'Male'
num2.sum()

3674

In [16]:
df.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [19]:
df['Salary']>100000

0       False
1       False
2        True
3       False
4        True
        ...
6699     True
6700    False
6701    False
6702     True
6703    False
Name: Salary, Length: 6704, dtype: bool

In [22]:
num_sal = (df['Salary']>100000)
num_sal.sum()

3772

In [28]:
num_sal = df['Salary']>100000
num_gen = df['Gender']=='Female'
num_f = num_sal & num_gen
num_f.sum()

1572

In [29]:
num_sal = df['Salary']>150000
num_gen = df['Gender']=='Female'
num_f = num_sal & num_gen
num_f.sum()

732

In [30]:
num_sal = (df['Salary']>200000)
num_gen = df['Gender']=='Female'
num_f = num_sal & num_gen
num_f.sum()

25

In [31]:
df['Salary'].max()

250000.0

In [32]:
df['Salary']>250000

0       False
1       False
2       False
3       False
4       False
        ...
6699    False
6700    False
6701    False
6702    False
6703    False
Name: Salary, Length: 6704, dtype: bool

In [35]:
num_sal = (df['Salary']>200000)
num_gen = df['Gender']=='Male'
num_f = num_sal & num_gen
num_f.sum()

89

In [64]:
df = pd.read_csv('salary_data.csv')
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [67]:
new_df = df[['Age','Salary','Gender','Education Level']]
new_df

       Age    Salary  Gender    Education Level
0     32.0   90000.0    Male         Bachelor's
1     28.0   65000.0  Female           Master's
2     45.0  150000.0    Male                PhD
3     36.0   60000.0  Female         Bachelor's
4     52.0  200000.0    Male           Master's
...    ...       ...     ...                ...
6699  49.0  200000.0  Female                PhD
6700  32.0   50000.0    Male        High School
6701  30.0   55000.0  Female  Bachelor's Degree
6702  46.0  140000.0    Male    Master's Degree
6703  26.0   35000.0  Female        High School

[6704 rows x 4 columns]

In [68]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [69]:
bach_count = df['Education Level']=="Bachelor's Degree"

In [71]:
bach_count.sum()

2267

In [72]:
mast_count2 = df['Education Level']=="Master's Degree"
mast_count2.sum()

1573

In [75]:
df = pd.read_csv('salary_data.csv')
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [76]:
mast_count2 = df['Education Level']=="Master's Degree"
mast_count2.sum()

1573